final class WordsProvider {

    static func getWords() -> [String] {
        return [
            "Индикатор",
            "Фоторобот",
            "Грамота",
            "Комната",
            "Пустота",
            "Робот",
            "Конструктор",
            "Ответ",
            "Юла",
            "Спецназ",
            "Маляр",
            "Сантехник",
            "Сокровище",
            "Коржик",
            "Сумерки",
            "Газировка",
            "Прогулка",
            "Прикол",
            "Туловище",
            "Комментатор",
            "Распашонка",
            "Йога",
            "Карандаш",
            "Идея",
            "Креатив",
            "Дурдом",
            "Эскиз",
            "Разведка",
            "Лимит",
            "Капитан",
            "Тариф",
            "Полупроводник",
            "Замечание",
            "Настроение",
            "Однокурсник",
            "Кинолог",
            "Тусовка",
            "Командир",
            "Секретарь",
            "Модем",
            "Конвой",
            "Вытеснение",
            "Поддон",
            "Столица",
            "Катастрофа",
            "Тест-драйв",
            "Жемчуг",
            "Панама",
            "Алтарь",
            "Харизматичность",
            "Просвещение",
            "Аллегория",
            "Поэма",
            "Парад",
            "Упырь",
            "Петиция",
            "Страсть",
            "Покровитель",
            "Содержание",
            "Романс",
            "Аватар",
            "Форекс",
            "Реквием",
            "Трапеза",
            "Пентаграмма",
            "Альфа",
            "Коррекция",
            "Тонкость",
            "Палитра",
            "Месть",
            "Концентрация",
            "Немощь",
            "Фурор",
            "Способность",
            "Адюльтер"
        ]
    }

    static func getRandomWords(num: Int) -> [String] {
        var words = getWords()
        var randomWords: [String] = []
        (0..<num).forEach { _ in
            let word = words.randomElement() ?? "apple"
            words = words.filter { $0 != word }
            randomWords.append(word)
        }

        return randomWords
    }

}
